namespace VSMS.Core.Constants
{
    public class ErrorMessages
    {
        private readonly Dictionary<int, string> msgs = new Dictionary<int, string>()
        {
            {100,"Възникна проблем при създаването на потребителя!"},
            {101,"Възникна проблем при редакцията на потребителя!"},
            {102,"Възникна проблем при изтриването на потребителя!"},
            {200,"Възникна проблем при създаването на продукта!"},
            {201,"Възникна проблем при редакцията на продукта!"},
            {202,"Възникна проблем при изтриването на продукта!"},
            {300,"Възникна проблем при създаването на категорията!"},
            {301,"Възникна проблем при изтриването на категорията!"},
            {400,"Възникна проблем при създаването на продажба!"},
            {401,"Възникна проблем при редакцията на продажбата!"},
            {402,"Възникна проблем при изтриването на продажбата!"},
            {500,"Възникна проблем при откриване на обекта!"},
        };

        public string? getMessage(int code)
        {
            if (this.msgs.ContainsKey(code))
            { return msgs[code]; }
            else
            { return null; }
        }
    }
}
